projects/New_Case/constant/dynamicMeshDict

    /*--------------------------------*- C++ -*----------------------------------*/
    FoamFile
    {
        format      binary;
        class       dictionary;
        location    "constant";
        object      dynamicMeshDict;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    dynamicFvMesh   dynamicMotionSolverFvMesh;

    motionSolver    displacementLaplacian;

    displacementLaplacianCoeffs
    {
        diffusivity     quadratic inverseDistance
        (
            
        );
    }

    motionSolverLibs ( "libfvMotionSolvers.so" );


    // ************************************************************************* //
    