projects/New_Case/constant/g

    /*--------------------------------*- C++ -*----------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "constant";
        object      uniformDimensionedVectorField;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    dimensions [0 1 -2 0 0 0 0];

    value (0 0 -9.81);

    // ************************************************************************* //
    