projects/New_Case/constant/phaseProperties

    /*--------------------------------*- C++ -*----------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "constant";
        object      phaseProperties;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    phases (Explosive Water Air);
    transportPhaseDensity yes;

    Air
    {
        type basic;
        calculateDensity yes;
        thermoType
        {
            transport   const;
            thermo      eConst;
            equationOfState idealGas;
        }
        equationOfState
        {
            gamma           1.4;
        }
        specie
        {
            molWeight       28.97;
        }
        transport
        {
            mu              0;              // Viscosity
            Pr              1;              // Prandtl number
        }
        thermodynamics
        {
            Cv          718;           // Heat capacity
            Hf          0.0;
        }

        residualRho     1e-6;
        residualAlpha   1e-6;
    }


    Water
    {
        type basic;
        calculateDensity yes;
        thermoType
        {
            transport   const;
            thermo      eConst;
            equationOfState linearTilloston;
        }
        equationOfState
        {
            p0      1e5;
            rho0    1000;
            e0      3.542e5;
            omega   0.28;
            A       2.2e9;
            B       9.94e9;
            C       14.57e9;
            pCav    5000;
        }
        specie
        {
            molWeight       18;
        }
        transport
        {
            mu              0;
            Pr              1;
        }
        thermodynamics
        {
            type        eConst;
            Cv          2400; // Give correct reference temperature
            Hf          0;
        }

        residualRho     1e-6;
        residualAlpha   1e-6;
    }

    Explosive
    {
        type detonating;
        calculateDensity yes;
        reactants
        {
            thermoType
            {
                transport   const;
                thermo      eConst;
                equationOfState Murnaghan;
            }
            equationOfState
            {
                Gamma           0.3;
                rho0            1601;
                K0              0;
                pRef            101325;
            }
            specie
            {
                molWeight       227.13;
            }
            transport
            {
                mu              0;              // Viscosity
                Pr              1;              // Prandtl number
            }
            thermodynamics
            {
                Cv              1095;           // Heat capacity
                Hf              0.0;
            }
        }
        products
        {
            thermoType
            {
                transport   const;
                thermo      eConst;
                equationOfState JWL;
            }
            equationOfState
            {
                rho0        1601;
                A           371.21e9;
                B           3.23e9;
                R1          4.15;
                R2          0.95;
                omega       0.3;
            }
            specie
            {
                molWeight       55.0;
            }
            transport
            {
                mu              0;              // Viscosity
                Pr              1;              // Prandtl number
            }
            thermodynamics
            {
                Cv              1400;           // Heat capacity
                Hf              0.0;
            }
        }

        activationModel none;
        initiation
        {
            E0              0.0;

            points     ();     // Detonation points
            vDet       6930;            // Detonation velocity [m/s]
        }

        residualRho     1e-6;           // Minimum density of the phase
        residualAlpha   1e-6;          // Minimum volume fraction used for division
    }


    // ************************************************************************* //
    