projects/New_Case/constant/transportProperties

    /*--------------------------------*- C++ -*----------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "constant";
        object      fluidProperties;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    simulationType laminar;
    // ************************************************************************* //
    