projects/New_Case/0/U.orig

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       volVectorField;
            object      U.orig;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        
        dimensions      [0 1 -1 0 0 0 0];
        
        internalField   uniform (0 0 0);
        
        boundaryField
        {
            #includeEtc "caseDicts/setConstraintTypes"

            walls
            {
                type            slip;
            }
            lungs
            {
                type            movingWallVelocity;
                value           $internalField;
            }

            outlet
            {
                type            zeroGradient;
            }

            tank
            {
                type            slip;
            }
        }

        // ************************************************************************* //
        