projects/New_Case/0/p.orig

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       volScalarField;
            object      p.orig;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        
        dimensions      [1 -1 -2 0 0 0 0];
        
        internalField   uniform 101325;
        
        boundaryField
        {
            #includeEtc "caseDicts/setConstraintTypes"
        
            walls
            {
                type            zeroGradient;
            }
            lungs
            {
                type            zeroGradient;
            }
        
            outlet
            {
                type            pressureWaveTransmissive;
                value           $internalField;
            }
        
            tank
            {
                type            zeroGradient;
            }
        }
        
        // ************************************************************************* //
        