projects/New_Case/0/pointDisplacement.orig

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {{
            version     2.0;
            format      ascii;
            class       pointVectorField;
            object      pointDisplacement.orig;
        }}
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        
        dimensions
        dimensions      [0 0 0 0 0 0 0];
        
        internalField   uniform (0 0 0);
        
        boundaryField
        {
            #includeEtc "caseDicts/setConstraintTypes"

            walls
            {
                type            fixedValue;
                value           $internalField;
            }
            lungs
            {
                type            fixedValue;
                value           $internalField;
            }

            outlet
            {
                type            fixedValue;
                value           $internalField;
            }

            tank
            {
                type            fixedValue;
                value           $internalField;
            }
        }

        // ************************************************************************* //
        