projects/New_Case/system/fvSchemes

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            version     2.
            version     2.0;
            format      ascii;
            class       dictionary;
            location    "system";
            object      fvSchemes;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

        fluxScheme      HLLC;

        ddtSchemes
        {
            default         Euler;
            timeIntegrator  RK2SSP;
        }

        gradSchemes
        {
            default         cellMDLimited leastSquares 1.0;
            grad(cellMotionU) Gauss linear;
        }

        divSchemes
        {
            default         none;
            div(alphaRhoPhi.Explosive,lambda.Explosive) Riemann;
            div(devTau) Gauss linear;
        }

        laplacianSchemes
        {
            default         Gauss linear corrected;
            laplacian(diffusivity,cellMotionU) Gauss linear uncorrected;
        }

        interpolationSchemes
        {
            default             linear;
            reconstruct(alpha)  Minmod;
            reconstruct(rho)    Minmod;
            reconstruct(U)      MinmodV;
            reconstruct(e)      Minmod;
            reconstruct(p)      Minmod;
            reconstruct(speedOfSound)   Minmod;

            reconstruct(lambda.Explosive) Minmod;
        }

        snGradSchemes
        {
            default         corrected;
        }

        // ************************************************************************* //
        