projects/New_Case/system/fvSolution

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       dictionary;
            location    "system";
            object      fvSolution;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

        solvers
        {
            "(rho|rhoU|rhoE|alpha|.*)"
            {
                solver          diagonal;
            }

            "(U|cellDisplacement|cellMotionU|e).*"
            {
                solver          PCG;
                preconditioner  DIC;
                tolerance       1e-8;
                relTol          0;
                minIter         1;
            }
        }

        // ************************************************************************* //
        