projects/New_Case/system/decomposeParDict

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       dictionary;
            location    "system";
            object      decomposeParDict;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        
        numberOfSubdomains 1;
        
        method         scotch;

        simpleCoeffs
        {
            n               ( 2 2 1 );
            delta           0.001;
        }
        
        distributed     no;
        
        roots           ( );
        
        // ************************************************************************* //
        