projects/New_Case/system/setFieldsDict

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       dictionary;
            location    "system";
            object      setFieldsDict;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

        fields (alpha.Water);

        defaultFieldValues
        (
            volScalarFieldValue alpha.Air 0
            volScalarFieldValue alpha.Explosive 0
            volScalarFieldValue alpha.Water 1
        );

        regions
        (
            boxToCell
            {
                box (-10 -10 83.8e-2) (10 10 10);
                level 3;
                fieldValues
                (
                    volScalarFieldValue alpha.Air   1
                    volScalarFieldValue alpha.Water 0
                    volScalarFieldValue alpha.Explosive   0
                );
            }
        );

        // ************************************************************************* //
        