projects/New_Case/system/surfaceFeaturesDict

        /*--------------------------------*- C++ -*----------------------------------*/
        FoamFile
        {
            format      ascii;
            class       dictionary;
            object      surfaceFeaturesDict;
        }
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

        surfaces
        (
            
        );

        includedAngle           150;

        closeness
        {
            pointCloseness          yes;
        }

        // ************************************************************************* //
        